php-implementation/exporhub-backend/artillery-api-backend-load-test.yml
config:
  target: "http://api.exporhub.com:9000"
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm Up Phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp Up Load Phase
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike Phase

scenarios:
  - flow:
    - loop:
        - get:
            url: '/'
        - get:
            url: '/api/user'
      count: 100