php-implementation/exporhub-backend/artillery-api-backend-load-test.yml
config:
  target: "https://api.exporhub.com:443"
  tls:
    rejectUnauthorized: false
  http:
    timeout: 60
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm Up Phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp Up Load Phase
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike Phase

scenarios:
  - flow:
    - loop:
        - get:
            url: '/'
        - get:
            url: '/api/users'
        - get:
            url: '/api/projects'
        - get:
            url: '/api/images'
        - get:
            url: '/api/follows'
        - get:
            url: '/api/favourites'
        - get:
            url: '/api/comments'
        - get:
            url: '/api/replies'
        - get:
            url: '/api/threads'
        - get:
            url: '/api/likes'
        - get:
            url: '/api/dislikes'
        - get:
            url: '/api/comment-likes'
        - get:
            url: '/api/comment-dislikes'
        - get:
            url: '/api/reply-likes'
        - get:
            url: '/api/reply-dislikes'
      count: 20